# 1

In [15]:
import pandas as pd

In [ ]:
'''
pandas.read_csv() - This function is used to read a CSV file and create a DataFrame object.
'''

import pandas as pd
df = pd.read_csv('example.csv')

In [2]:
'''
DataFrame.head() - This function is used to return the first n rows of a DataFrame.
'''

df = pd.read_csv('example.csv')
print(df.head(5))       # returns first 5 rows of df

"\nDataFrame.head() - This function is used to return the first n rows of a DataFrame.\n\n\ndf = pd.read_csv('example.csv')\nprint(df.head(5))       # returns first 5 rows of df\n"

In [ ]:
'''
DataFrame.dropna() - This function is used to remove missing values (NaN) from a DataFrame.
'''

import pandas as pd
df = pd.read_csv('example.csv')
df.dropna(inplace=True) # removes rows with NaN values

In [ ]:
'''
DataFrame.groupby() - This function is used to group data in a DataFrame based on one or more columns.
'''

import pandas as pd
df = pd.read_csv('example.csv')
grouped_data = df.groupby('column_name')

In [ ]:
'''
DataFrame.merge() - This function is used to merge two DataFrames based on one or more columns.
'''

import pandas as pd
df1 = pd.read_csv('example1.csv')
df2 = pd.read_csv('example2.csv')
merged_df = df1.merge(df2, on='column_name')

# 2

In [8]:
'''
Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new
index that starts from 1 and increments by 2 for each row
'''

data = {
    'A': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'B': ['HR', 'Sales', 'IT', 'Sales', 'HR', 'IT'],
    'C': [100000, 50000, 75000, 60000, 40000, 80000]
}
df = pd.DataFrame(data)
df

         A      B       C
0    Alice     HR  100000
1      Bob  Sales   50000
2  Charlie     IT   75000
3    David  Sales   60000
4      Eva     HR   40000
5    Frank     IT   80000

In [11]:
def reindex_df(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    new_df = df.copy()
    new_df.index = new_index
    return new_df

In [12]:
reindex_df(df)

          A      B       C
1     Alice     HR  100000
3       Bob  Sales   50000
5   Charlie     IT   75000
7     David  Sales   60000
9       Eva     HR   40000
11    Frank     IT   80000

# 3

In [15]:
data = {'value': [10, 20, 30, 40, 50], 
        'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily']}
df = pd.DataFrame(data)
print(df)

   value     name
0     10    Alice
1     20      Bob
2     30  Charlie
3     40    David
4     50    Emily

In [25]:
def sum_3_values(df):
     return sum(df.loc[0:2, 'value'])

In [26]:
sum_3_values(df)

60

# 4

In [36]:
data = {'text': ['Alice', 'Bob ross', 'Charlie von rawn', 'David ewlsh smith jr', 'Emily alberts']}
df = pd.DataFrame(data)
df

                   text
0                 Alice
1              Bob ross
2      Charlie von rawn
3  David ewlsh smith jr
4         Emily alberts

In [49]:
def word_cnt(df):
    word_count = df['text'].str.split().str.len()
    df['word_count'] = word_count
    return df

In [50]:
word_cnt(df)

                   text  word_count
0                 Alice           1
1              Bob ross           2
2      Charlie von rawn           3
3  David ewlsh smith jr           4
4         Emily alberts           2

# 5

In [ ]:
'''
DataFrame.size() returns the number of elements in a DataFrame, which is equal to the product of the number of rows and the number of columns.
DataFrame.shape() returns a tuple containing the number of rows and the number of columns in the DataFrame.
'''

# 6

In [51]:
'''pandas.read_excel() function'''

'pandas.read_excel() function'

# 7

In [83]:

data = {'Email': ['john.doe@example.com', 'jane.doe@example.com', 'foo.bar@example.com', 'baz.qux@example.com', 'alice@example.com']}
df = pd.DataFrame(data)
df

                  Email
0  john.doe@example.com
1  jane.doe@example.com
2   foo.bar@example.com
3   baz.qux@example.com
4     alice@example.com

In [85]:
def extract_username(email):

    return email.split('@')[0]

# Create 'Username' column using the extract_username function
df['Username'] = df['Email'].apply(extract_username)
df

                  Email  Username
0  john.doe@example.com  john.doe
1  jane.doe@example.com  jane.doe
2   foo.bar@example.com   foo.bar
3   baz.qux@example.com   baz.qux
4     alice@example.com     alice

# 8

In [99]:
def select_rows(df):
    return df[(df['A']>5) & (df['B']<10)]

In [100]:
data = {'A':[3,8,6,2,9],  'B':[5,2,9,32,11],  'C':[1,7,4,5,2]}
df = pd.DataFrame(data)
df

   A   B  C
0  3   5  1
1  8   2  7
2  6   9  4
3  2  32  5
4  9  11  2

In [101]:
select_rows(df)

   A  B  C
1  8  2  7
2  6  9  4

# 9

In [ ]:
def calculate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    print("Mean: ", mean)
    print("Median: ", median)
    print("Standard Deviation: ", std_dev)

# 10

In [ ]:
def calculate_moving_average(df):
    ma = df['Sales'].rolling(window=7, min_periods=1).mean()
    df['MovingAverage'] = ma
    return df

# 11

In [7]:

# Create a sample DataFrame with a 'Date' column
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

# Convert the 'Date' column to a datetime format
df['Date'] = pd.to_datetime(df['Date'])

# Create a new column called 'Weekday' with the weekday name
df['Weekday'] = df['Date'].dt.day_name()

In [8]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# 12

In [10]:

def select_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    mask = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')
    return df[mask]

In [13]:
df = pd.DataFrame({'Date': ['2023-01-25', '2023-02-26', '2023-01-27', '2023-02-28', '2023-03-01']})

In [14]:
select_dates(df)

        Date
0 2023-01-25
2 2023-01-27

# 13

In [ ]:
'''
The first and foremost necessary library that needs to be imported to use the basic functions of Pandas is pandas itself.
'''